## Terraform Plan Results

✅ Plan succeeded

<details>
<summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.functions.google_storage_bucket_object.scoring_source has been deleted
  - resource "google_storage_bucket_object" "scoring_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip"
      - name             = "functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> null
        # (14 unchanged attributes hidden)
    }

  # module.functions.google_storage_bucket_object.webhook_source has been deleted
  - resource "google_storage_bucket_object" "webhook_source" {
        id               = "wedding-smile-images-wedding-smile-catcher-functions/webhook-29155a80fa32342c1270a45b171107db.zip"
      - name             = "functions/webhook-29155a80fa32342c1270a45b171107db.zip" -> null
        # (14 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # google_project_service.required_apis["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "wedding-smile-catcher"
      + service            = "monitoring.googleapis.com"
    }

  # module.functions.data.archive_file.scoring_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "scoring_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/scoring"
      + type                = "zip"
    }

  # module.functions.data.archive_file.webhook_source will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "webhook_source" {
      + excludes            = [
          + "*.pyc",
          + ".DS_Store",
          + ".env",
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../src/functions/webhook"
      + type                = "zip"
    }

  # module.functions.google_cloudfunctions2_function.scoring will be updated in-place
  ~ resource "google_cloudfunctions2_function" "scoring" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/scoring"
        name             = "scoring"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/scoring-a550c49cc24649c3c9d6e7fb0544e3eb.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID" = "test" -> null
                # (3 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
                # (3 unchanged attributes hidden)
            }
        }
    }

  # module.functions.google_cloudfunctions2_function.webhook will be updated in-place
  ~ resource "google_cloudfunctions2_function" "webhook" {
        id               = "projects/wedding-smile-catcher/locations/asia-northeast1/functions/webhook"
        name             = "webhook"
        # (10 unchanged attributes hidden)

      ~ build_config {
            # (6 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ object     = "functions/webhook-29155a80fa32342c1270a45b171107db.zip" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ environment_variables            = {
              - "CURRENT_EVENT_ID"     = "test" -> null
                # (4 unchanged elements hidden)
            }
            # (11 unchanged attributes hidden)

          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_ACCESS_TOKEN" -> "LINE_CHANNEL_SECRET"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-access-token" -> "line-channel-secret"
                # (1 unchanged attribute hidden)
            }
          ~ secret_environment_variables {
              ~ key        = "LINE_CHANNEL_SECRET" -> "LINE_CHANNEL_ACCESS_TOKEN"
              ~ project_id = "548587922270" -> "wedding-smile-catcher"
              ~ secret     = "line-channel-secret" -> "line-channel-access-token"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.functions.google_storage_bucket_object.scoring_source will be created
  + resource "google_storage_bucket_object" "scoring_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.functions.google_storage_bucket_object.webhook_source will be created
  + resource "google_storage_bucket_object" "webhook_source" {
      + bucket         = "wedding-smile-images-wedding-smile-catcher"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + generation     = (known after apply)
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + md5hexhash     = (known after apply)
      + media_link     = (known after apply)
      + name           = (known after apply)
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = (known after apply)
      + storage_class  = (known after apply)
    }

  # module.monitoring.google_monitoring_alert_policy.scoring_errors will be created
  + resource "google_monitoring_alert_policy" "scoring_errors" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Scoring Function Errors"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "wedding-smile-catcher"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Scoring error rate > 5%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type = "cloud_function"
                    AND resource.labels.function_name = "scoring"
                    AND metric.type = "cloudfunctions.googleapis.com/function/execution_count"
                    AND metric.labels.status != "ok"
                EOT
              + threshold_value = 5

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_RATE"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = "Scoring Cloud Function is experiencing errors. Check Cloud Functions logs for details."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.scoring_latency will be created
  + resource "google_monitoring_alert_policy" "scoring_latency" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Scoring Function High Latency"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "wedding-smile-catcher"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Scoring latency > 30s (p95)"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type = "cloud_function"
                    AND resource.labels.function_name = "scoring"
                    AND metric.type = "cloudfunctions.googleapis.com/function/execution_times"
                EOT
              + threshold_value = 30000000000

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_MEAN"
                  + per_series_aligner   = "ALIGN_PERCENTILE_95"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = "Scoring function latency is high. AI processing may be slow."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.webhook_errors will be created
  + resource "google_monitoring_alert_policy" "webhook_errors" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Webhook Function Errors"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "wedding-smile-catcher"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Webhook error rate > 5%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type = "cloud_function"
                    AND resource.labels.function_name = "webhook"
                    AND metric.type = "cloudfunctions.googleapis.com/function/execution_count"
                    AND metric.labels.status != "ok"
                EOT
              + threshold_value = 5

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + per_series_aligner   = "ALIGN_RATE"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = "Webhook Cloud Function is experiencing errors. Check Cloud Functions logs for details."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.webhook_latency will be created
  + resource "google_monitoring_alert_policy" "webhook_latency" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Webhook Function High Latency"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "wedding-smile-catcher"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "Webhook latency > 10s (p95)"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type = "cloud_function"
                    AND resource.labels.function_name = "webhook"
                    AND metric.type = "cloudfunctions.googleapis.com/function/execution_times"
                EOT
              + threshold_value = 10000000000

              + aggregations {
                  + alignment_period     = "300s"
                  + cross_series_reducer = "REDUCE_MEAN"
                  + per_series_aligner   = "ALIGN_PERCENTILE_95"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = "Webhook function latency is high. This may affect user experience."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_notification_channel.email will be created
  + resource "google_monitoring_notification_channel" "email" {
      + display_name        = "Wedding Smile Catcher Alerts"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "nakayamaryo0731@gmail.com"
        }
      + name                = (known after apply)
      + project             = "wedding-smile-catcher"
      + type                = "email"
      + verification_status = (known after apply)
    }

Plan: 8 to add, 2 to change, 0 to destroy.
```

</details>

**Pusher**: @nakayamaryo0731
**Action**: pull_request
